Frühe Jahre
Arnulf wurde früh entdeckt. Der Wolf, bekannt für seine Gerissenheit, nahm ihn als jungen Streiter auf.
Dort lernte der Bulle den Wert von Disziplin und Stärke – aber auch die Härte des Krieges.

Als der Wolf jedoch fiel, verlor Arnulf seine Richtung. 
Er schloss sich dem Schwein an, das ihn mit offenen Armen empfing.
Dort fand er etwas, das besser zu ihm passte:
Nicht List, nicht Raffinesse – sondern rohe Gewalt, Masse und der Wille, den Gegner niederzuwalzen.“

Seine Philosophie
„Arnulf glaubt nicht an Elitearmeen oder taktische Meisterwerke.
Er glaubt daran, dass jede Waffe, jeder Soldat und jeder Arbeiter seinen Platz im Krieg hat.
Wo andere abwägen, setzt er auf Überzahl und Aggression.
Er lebt nach dem Grundsatz:
‚Jede Einheit ist eine Waffe. Alles, was kämpfen kann, wird kämpfen.‘

Deshalb sieht man in seinen Armeen nicht nur einzelne Truppengattungen, sondern das ganze Spektrum von Stronghold.“

Seine Truppen
„An vorderster Front stehen Speerkämpfer.
Billig, schwach, aber massenhaft – sie sind das Fleischschild seiner Kriegsführung.
Sie absorbieren Pfeile, sie blockieren den Feind, sie schaffen Raum für den wahren Schlag.

Hinter ihnen: die Streitkolbenkämpfer.
Für Arnulf sind sie der Schläger, Rammböcke in Menschengestalt.
Sie zertrümmern Mauern, sie erschlagen Gegner mit wilder Gewalt.

Die Pikeniere bilden sein Bollwerk.
Langsam, aber standhaft – sie sind da, um den Druck auszuhalten, wenn andere längst zerfallen wären.

Schwertkämpfer sind in seinen Reihen selten, aber dennoch vorhanden.
Sie sind die Klingen seiner Armee, das Elitewerkzeug, wenn er es sich leisten kann.
Doch Ritter? – Ritter verachtet der Bulle. Zu teuer. Zu stolz. Zu sehr Symbol einer Elite, zu der er nie gehörte.
Arnulf ist ein Mann des Volkes. Und so kämpft er auch mit den Truppen des Volkes.“

Warum er alle Einheiten nutzt
„Im Gegensatz zu vielen anderen Kriegsherren lehnt Arnulf keine Truppenart ab.
Er weiß: Jeder Arbeiter kann ein Kämpfer werden. Jeder Soldat hat einen Zweck.
Und so finden sich in seinen Heeren Speerkämpfer, Schläger, Assassinen, sogar Tunnelgräber – 
alles, was in irgendeiner Form dem Krieg dient.

Seine Burgen
„Seine Burgen spiegeln ihn selbst wider: massiv, roh, direkt.
Seine frontalen Torhäuser – immer überladen, immer ungeschützt.
Arnulf verlässt sich darauf, dass seine Masse den Feind zerschlägt, bevor dieser Schwächen ausnutzen kann.
Ironischerweise macht genau das ihn anfällig für das, was er selbst so sehr liebt: den Frontalangriff.“

Seine Schwächen
„Arnulf setzt auf Masse statt Präzision.
Doch Masse ist teuer. Sie ist schwerfällig. Sie ist ineffizient.
Trifft er auf einen Gegner, der gezielt Schwertkämpfer oder Ritter einsetzt, zeigen sich Risse in seiner Philosophie.
Denn während der Bulle alles in die Waagschale wirft – werfen andere nur das Beste.“

Fazit
„Arnulf, der Bulle – ein Herrscher der Breite, nicht der Tiefe.
Er lebt vom Chaos der Masse, nicht von der Klarheit der Taktik.
Doch wenn er mit all seiner Kraft anstürmt, erbebt das Schlachtfeld.
Denn er hat nur ein Credo:
‚Jede Einheit ist eine Waffe. Alles, was kämpfen kann, wird kämpfen.‘